SaeidYazdani/stm32-bldc-simulator/Inc/main.h
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H__
#define __MAIN_H__

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx.h"
#include "stm32f4xx_ll_gpio.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private define ------------------------------------------------------------*/

#define BUTTON_USER_Pin LL_GPIO_PIN_0
#define BUTTON_USER_GPIO_Port GPIOA
#define BUTTON_USER_EXTI_IRQn EXTI0_IRQn
#define LED_STATE_Pin LL_GPIO_PIN_12
#define LED_STATE_GPIO_Port GPIOD
#define HALL_C_Pin LL_GPIO_PIN_13
#define HALL_C_GPIO_Port GPIOD
#define HALL_B_Pin LL_GPIO_PIN_14
#define HALL_B_GPIO_Port GPIOD
#define HALL_A_Pin LL_GPIO_PIN_15
#define HALL_A_GPIO_Port GPIOD
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* USER CODE BEGIN Private defines */

#define BIT_0                 ((uint16_t)0x0001)  /* Bit 0 selected    */
#define BIT_1                 ((uint16_t)0x0002)  /* Bit 1 selected    */
#define BIT_2                 ((uint16_t)0x0004)  /* Bit 2 selected    */
#define BIT_3                 ((uint16_t)0x0008)  /* Bit 3 selected    */
#define BIT_4                 ((uint16_t)0x0010)  /* Bit 4 selected    */
#define BIT_5                 ((uint16_t)0x0020)  /* Bit 5 selected    */
#define BIT_6                 ((uint16_t)0x0040)  /* Bit 6 selected    */
#define BIT_7                 ((uint16_t)0x0080)  /* Bit 7 selected    */
#define BIT_8                 ((uint16_t)0x0100)  /* Bit 8 selected    */
#define BIT_9                 ((uint16_t)0x0200)  /* Bit 9 selected    */
#define BIT_10                ((uint16_t)0x0400)  /* Bit 10 selected   */
#define BIT_11                ((uint16_t)0x0800)  /* Bit 11 selected   */
#define BIT_12                ((uint16_t)0x1000)  /* Bit 12 selected   */
#define BIT_13                ((uint16_t)0x2000)  /* Bit 13 selected   */
#define BIT_14                ((uint16_t)0x4000)  /* Bit 14 selected   */
#define BIT_15                ((uint16_t)0x8000)  /* Bit 15 selected   */
#define BIT_ALL               ((uint16_t)0xFFFF)  /* All bits selected */

/* USER CODE END Private defines */

#ifdef __cplusplus
 extern "C" {
#endif
void _Error_Handler(char *, int);

#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H__ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
